/*
 * @Author: Lin
 * @Date: 2019-11-13 22:42:18
 * @LastEditTime: 2019-12-07 11:34:49
 * @Description: 修改原简历内容
 * @FilePath: \resume\config\render\section.js
 */
/**
 * 对文段的一个简单封装
 */
const p = (left = '', right = '') => {
  return { left, right }
}
/**
 * header
 * 默认将内容转为h4
 */
const h = (left = '', right = '') => {
  return { left: `#### ${left}`, right: `#### ${right}` }
}

/**
 * 正文部分
 * 说明：本模版在pc端和打印端采用两栏式显示，手机端采用单栏
 * 请自己判断并适应页面尺寸
 */
export default [
  /**
   * 每一个小模块，都有以下几个配置项：
   * title： 顶部名称栏
   * content: 里面的内容，需要注意的是每一条内容都会换行
   */
  {
    title: '工作经历',
    content: [
      /**
       * 文章正文部分
       * left, right: 需要显示的文字，支持 b, i, a 等html标签以及一切markdown文本，请自由配置
       */
      p(
        `**北京知乎网技术有限公司**`,
        `2023.07 - 至今`
      ),
      p(
        `*基础平台部·后端开发工程师*`,
      ),
      p(
        `主要负责知乎整个数据库架构的平台化工作，包括日常开发、维护和 oncall。`
      ),
    ],
  },
  {
    title: '项目经历',
    content: [
      p(
        `**天穹平台开发**`,
      ),
      p(
        `*实现了 80% 以上 DB 运维操作平台化、标准化*`,
      ),
      p(
        `负责天穹平台 mysql,tidb,server 等模块的开发，⾼质量地按时交付所有需求的上线，个⼈需求延期率为 0`,
      ),
      p(
        `**DB 巡检功能开发**`,
      ),
      p(
        `*负责人*`,
      ),
      p(
        `*实现 MySQL 实例自动 balance，提升数据库集群稳定性*`,
      ),
      p(
        `基于指标系统进行主机磁盘、网络等数据采集，根据指标数据、实例密度、调度策略等生成实例调度计划并执行，保障 mysql 集群稳定高效运行`,
      ),
      p(
        `**参与机房迁移**`,
      ),
      p(
        `*迁移过程全流程平台化，实现零故障迁移*`,
      ),
      p(
        `参与 MySQL 迁移平台开发，实现动态实例投放，保证前置检查、数据迁移、数据同步、切换全流程状态追踪`,
      ),
    ],
  },
  {
    title: '实习经历',
    content: [
      p(
        `**上海七牛云**`,
        `2023.02 - 2023.06`
      ),
      p(
        `*基础业务部·golang开发实习生*`,
      ),
      p(
        `负责参与*专有云平台（RIO）* 的开发和维护，实现虚拟机的模板和部署，以及定制化需求开发。`
      ),
      p(
        `**哔哩哔哩（bilibili）**`,
        `2022.08 - 2022.12`
      ),
      p(
        `*工程效率部·golang开发实习生*`,
      ),
      p(
        `参与*云效平台（Marthe）* 的开发和维护，实现数据汇总和分析，为 PMO 报表大盘提供数据支撑。`
      ),
    ],
  },
  {
    title: '个人能力',
    content: [
      p(`*熟悉go语言：* 对go语言一些特殊性质，如GPM等有一定的理解，并经常仿造GitHub上优秀代码的实现，如gin框架、gorm框架等，能够实现快速开发。`),
      p(`*熟悉k8s相关知识：* 了解 k8s 各个组件，docker 等使用`),
      p(`*熟悉关系型数据库 MySQL：* 对其 innodb 存储引擎、事务的特性、多版本并发控制、B+树等有简单的了解。`),
      p(`*熟悉Redis：* 知道其实现的数据类型、主从复制、持久化的实现、AOF重写、数据淘汰策略等，看过部分底层渐进式rehash的实现`),
      p(`*熟悉基础的计算机网络知识：* 了解各层的划分、tcp的连接管理、动态路由寻址、HTTP请求、DNS域名解析等`),
      p(`*熟悉个别操作系统知识：* 进程的同步、进程间的通信、设备的管理、内存的分配和个别分配算法等`),
    ],
  },
  {
    title: '个人作品',
    content: [
      h(`个人主页 [mulinbiao.com](https://mulinbiao.com)`),
      p(
        `以[mulinbiao.com](https://mulinbiao.com)作为个人域名，github 托管源码，vercel 完成部署。`
      ),
      h(`个人博客 [blog.mulinbiao.com](https://blog.mulinbiao.com)`),
      p(
        `折腾过WordPress、 Hexo，也尝试自己制作，最终选用 hugo 驱动，作为日常随笔记录，随性更新。`
      ),
      h(`“adastra” · 个性化视频推荐网站`),
      p(
        `一个模仿 bilibili 风格的个性化视频推荐网站，基于 springboot + vue 实现，仅为体验中大型 web 项目团队开发，带领团队获得项目汇报优胜金将。`
      ),
    ],
  },
]
