/*
 * @Author: Lin
 * @Date: 2019-11-13 22:42:18
 * @LastEditTime: 2019-12-07 11:34:49
 * @Description: 修改原简历内容
 * @FilePath: \resume\config\render\section.js
 */
/**
 * 对文段的一个简单封装
 */
const p = (left = '', right = '') => {
  return { left, right }
}
/**
 * header
 * 默认将内容转为h4
 */
const h = (left = '', right = '') => {
  return { left: `#### ${left}`, right: `#### ${right}` }
}

/**
 * 正文部分
 * 说明：本模版在pc端和打印端采用两栏式显示，手机端采用单栏
 * 请自己判断并适应页面尺寸
 */
export default [
  /**
   * 每一个小模块，都有以下几个配置项：
   * title： 顶部名称栏
   * content: 里面的内容，需要注意的是每一条内容都会换行
   */
  {
    title: '工作经历',
    content: [
      /**
       * 文章正文部分
       * left, right: 需要显示的文字，支持 b, i, a 等html标签以及一切markdown文本，请自由配置
       */
      p(
        `**知乎**`,
        `2023.07 - 2024.08`
      ),
      p(
        `*基础平台部·后端开发工程师（北京）*`,
      ),
      p(
        `主要负责知乎整个数据库架构的平台化工作，包括日常开发、维护和 oncall承接。`
      ),
    ],
  },
  {
    title: '项目经历',
    content: [
      p(
        `**天穹平台开发**`,
      ),
      p(
        `*项目背景*`,
      ),
      p(
        `建设知乎一站式数据库管理平台，支撑业务日常数据库管理需求，提升DBA的运维自动化、平台化能力，包括统一资源大盘、数据库运维自动化、数据库安全可控、DB智能巡检、提升易用性。`,
      ),
      p(
        `*个人工作*`,
      ),
      p(
        `负责平台 MySQL、TiDB、Server 等模块开发，高质量的按时交付所有需求的上线，个人需求延期率为 0。`,
      ),
      p(
        `*取得成果*`,
      ),
      p(
        `实现知乎 80% 以上 DB 运维操作平台化、标准化，DB 运维效率提升 2 倍以上。`,
      ),
      p(
        `**MySQL 实例调度模块设计开发**`,`*负责人*`
      ),
      p(
        `*项目背景*`,
      ),
      p(
        `为了降低 MySQL 单机数据库实例部署密度、提高资源利用率、提升数据库的性能和稳定性，以及降低因宿主机故障导致的事故爆炸半径，保障服务水平协议（SLA）的达成。`,
      ),
      p(
        `*个人工作*`,
      ),
      p(
        `基于指标系统进行主机磁盘、cpu、网络等数据采集，根据指标数据、实例密度、调度策略等自动生成实例调度计划并执行，保障 mysql 集群稳定高效运行。`,
      ),
      p(
        `*取得成果*`,
      ),
      p(
        `MySQL 单机部署密度降低 50%，资源利用率提升 1 倍。`,
      ),
      p(
        `实现 500+ MySQL 集群，共计 4000+ 实例的稳定、自动化调度，提升了集群稳定性和运维效率。`,
      ),
      p(
        `**机房迁移**`,
      ),
      p(
        `*项目背景*`,
      ),
      p(
        `由于知乎与云厂商机房合作到期，需要将全量服务迁移至新机房，保证业务不中断。`,
      ),
      p(
        `*个人工作*`,
      ),
      p(
        `参与 MySQL 迁移模块开发，实现动态实例投放，保证前置检查、数据迁移、数据同步、切换全流程状态可追踪。`,
      ),
      p(
        `*取得成果*`,
      ),
      p(
        `实现迁移过程全流程平台化，迁移过程 0 故障。`,
      ),
    ],
  },
  {
    title: '实习经历',
    content: [
      p(
        `**七牛云**`,
        `2023.02 - 2023.06`
      ),
      p(
        `*基础业务部 · golang开发实习生（上海）*`,
      ),
      p(
        `负责参与*专有云平台（RIO）* 的开发和维护，实现虚拟机的模板和部署，以及定制化需求开发。`
      ),
      p(
        `**哔哩哔哩（bilibili）**`,
        `2022.08 - 2022.12`
      ),
      p(
        `*工程效率部 · golang开发实习生（上海）*`,
      ),
      p(
        `参与*云效平台（Marthe）* 的开发和维护，实现数据汇总和分析，为 PMO 报表大盘提供数据支撑。`
      ),
    ],
  },
  {
    title: '个人能力',
    content: [
      p(`*熟悉go语言：* 对go语言一些特殊性质，如GPM等有一定的理解，并经常仿造GitHub上优秀代码的实现，如gin框架、gorm框架等，能够实现快速开发。`),
      p(`*熟悉k8s相关知识：* 了解 k8s 各个组件，docker 等使用。`),
      p(`*熟悉关系型数据库 MySQL：* 对其 innodb 存储引擎、事务的特性、多版本并发控制、B+树等有简单的了解。`),
      p(`*熟悉Redis：* 知道其实现的数据类型、主从复制、持久化的实现、AOF重写、数据淘汰策略以及一致性哈希等。`),
      p(`*熟悉基础的计算机网络知识：* 了解各层的划分、tcp的连接管理、动态路由寻址、HTTP请求、DNS域名解析等。`),
      p(`*熟悉个别操作系统知识：* 进程的同步、进程间的通信、设备的管理、内存的分配和个别分配算法等。`),
    ],
  },
  {
    title: '个人作品',
    content: [
      h(`个人主页 [mulinbiao.com](https://mulinbiao.com)`),
      p(
        `以[mulinbiao.com](https://mulinbiao.com)作为个人域名，使用 github 托管源码，vercel 完成部署。`
      ),
      h(`个人博客 [blog.mulinbiao.com](https://blog.mulinbiao.com)`),
      p(
        `折腾过WordPress、 Hexo，也尝试自己制作，最终选用 hugo 驱动，作为日常随笔记录，随性更新。`
      ),
      h(`“adastra” · 个性化视频推荐网站`),
      p(
        `一个模仿 bilibili 风格的个性化视频推荐网站，基于 springboot + vue 实现，仅为体验中大型 web 项目团队开发，带领团队获得项目汇报优胜金将。`
      ),
    ],
  },
]
