/*
 * @Author: Lin
 * @Date: 2019-11-13 22:42:18
 * @LastEditTime: 2019-12-07 11:34:49
 * @Description: 修改原简历内容
 * @FilePath: \resume\config\render\section.js
 */
/**
 * 对文段的一个简单封装
 */
const p = (left = '', right = '') => {
  return { left, right }
}
/**
 * header
 * 默认将内容转为h4
 */
const h4 = (left = '', right = '') => {
  return { left: `#### ${left}`, right: `#### ${right}` }
}

/**
 * header
 * 默认将内容转为h5
 */
const h5 = (left = '', right = '') => {
  return { left: `##### ${left}`, right: `##### ${right}` }
}

/**
 * 正文部分
 * 说明：本模版在pc端和打印端采用两栏式显示，手机端采用单栏
 * 请自己判断并适应页面尺寸
 */
export default [
  {
    title: '工作经历',
    content: [
      /**
       * 文章正文部分
       * left, right: 需要显示的文字，支持 b, i, a 等html标签以及一切markdown文本，请自由配置
       */
      p(
        `**百度（北京）** 通用搜索产品研发组-后端开发`,
        `2024.09 - 2025.03`
      ),

      p("*1.VUI 迁移 SEARCH-UIGO*"),

      p(
        "*项目背景：* VUI 是由 PHP 开发、HHVM 运⾏的服务，主要职责是请求检索系统获取结果，并依次进⾏模板选择、实时摘要补充、数据适配和结果渲染。⽬前，搜索展现服务由数⼗个产品线、上百 RD 共同参与研发，承载了数百个精细化的业务展现策略。然⽽，随着搜索业务的迭代和技术升级，VUI 也⾯临着技术⽣态劣势、服务复杂度⾼、可复⽤性低等内外部的多重问题与挑战。"
      ),

      p(
        "*解决方案：* 1. 技术底座升级：从 PHP+HHVM 转型 GO，获得更好的性能和更⾼的并发处理能⼒。2. 降低服务复杂度：引入图执行引擎，将展现功能以算⼦的粒度进⾏拆分，业务⽅把⼯作聚焦在功能（算⼦）和需求，⽽⾮应⽤整体，降低流程管理的复杂度。3. 提升可复⽤性：通过抽象公共算⼦和实施基础 lib 共建，提⾼代码的可复⽤性和可维护性。"
      ),

      p(
        "*主要工作：* 负责各阶段相关策略迁移、公用 lib 库开发与维护、线上 diff 修复、日常 oncall 承接。"
      ),

      p(
        "*项目成果:* 项目荣获 *20224Q4 MEG 百度⼩赞* 激励；迁移后 CPU 优化 *10%*（约 5w 核），端到端 80 分位⾸屏速度优化 *14ms*；⽆效&废弃展现策略下线约 *200+*，约占整体 *40%*；公共算⼦ *30+*，基础设施在产研多服务、多 API 应⽤。",
      ),

      p("*2.增长运营25CNY春节活动开发*","*协调支援*"),

      p(
        "*项目背景：* 预期利用中国地图，探索34个省份，打造团员中国年的概念。用优质的特效以及红包奖励，拉动用户深度参与，提高任务导流和裂变的收益。"
      ),

      p(
        "*主要工作：* 协助团圆地图、红包雨等活动相关模块开发，任务中台、引导平台等相关模块改造适配。"
      ),

      p(
        "*项目成果:* 项目荣获 *2024 年 MEG 优秀项⽬奖*",
      ),
    ],
  },

  {
    title: '实习经历',
    content: [
      p(
        `**七牛云（上海）** 基础业务部-后端开发`,
        `2023.02 - 2023.06`
      ),
      p(
        `负责参与*专有云平台（RIO）* 的开发和维护，实现虚拟机的模板和部署，以及定制化需求开发。`
      ),
      p(
        `**哔哩哔哩（上海）** 工程效率部-后端开发`,
        `2022.08 - 2022.12`
      ),
      p(
        `参与*云效平台（Marthe）* 的开发和维护，实现数据汇总和分析，为 PMO 报表大盘提供数据支撑。`
      ),
    ],
  },

  {
    content: [
      /**
       * 文章正文部分
       * left, right: 需要显示的文字，支持 b, i, a 等html标签以及一切markdown文本，请自由配置
       */
      p(
        `**知乎（北京）** 基础平台部-后端开发`,
        `2023.07 - 2024.08`
      ),

      p("*1.天穹平台开发*"),

      p(
        "*项目背景：* 建设知乎一站式数据库管理平台，支撑业务日常数据库使用需求，提升 DBA 的运维效率，包括统一资源大盘、数据库运维自动化、数据库安全可控、DB 智能巡检、易用性提升。"
      ),

      p(
        "*主要工作：* 负责平台 MySQL、TiDB、Server  等模块开发，高质量的按时交付所有需求的上线，个人需求延期率为 0。"
      ),

      p(
        `*项目成果：* 实现知乎 *80%* 以上 DB 运维操作平台化、标准化，DB 运维效率提升 *2 倍*以上。`,
      ),

      p(
        `*2.MySQL 实例调度模块设计开发*`,`*负责人*`
      ),

      p(
        "*项目背景：* 为了降低 MySQL 单机数据库实例部署密度、提高资源利用率、提升数据库的性能和稳定性，以及降低因宿主机故障导致的事故爆炸半径，保障服务水平协议（SLA）的达成。"
      ),

      p(
        "*主要工作：* 基于指标系统进行主机磁盘、cpu 、网络等数据采集，根据指标数据、实例密度、调度策略等自动生成实例调度计划并执行，保障 mysql  集群稳定高效运行。"
      ),

      p(
        `*项目成果：* MySQL 单机部署密度降低 *50%*，资源利用率提升 *1 倍*；实现 *500+* MySQL 集群，共计 *4000+* 实例的稳定、自动化调度，提升了集群稳定性和运维效率。`,
      ),

      p(
        `*3.在线机房迁移*`
      ),

      p(
        "*项目背景：* 由于知乎与云厂商机房合作到期，需要将全量服务迁移至新机房，保证业务不中断。"
      ),

      p(
        "*主要工作：* 负责 MySQL  迁移相关平台及工具开发，实现动态实例投放，保证前置检查、数据迁移、数据同步、切换全流程状态可追踪。"
      ),

      p(
        `*项目成果：* MySQL在线机房迁移过程全流程平台化，迁移过程 0 故障。`,
      ),
    ],
  },

  {
    title: '个人作品',
    content: [
      h4(`个人主页 [mulinbiao.com](https://mulinbiao.com)`),
      p(
        `以[mulinbiao.com](https://mulinbiao.com)作为个人域名，使用 github 托管源码，vercel 完成部署。`
      ),
      h4(`个人博客 [blog.mulinbiao.com](https://blog.mulinbiao.com)`),
      p(
        `折腾过WordPress、 Hexo，也尝试自己制作，最终选用 hugo 驱动，作为日常随笔记录，随性更新。`
      ),
      h4(`“adastra” · 个性化视频推荐网站`),
      p(
        `一个模仿 bilibili 风格的个性化视频推荐网站，基于 springboot + vue 实现，仅为体验中大型 web 项目团队开发，带领团队获得项目汇报优胜金将。`
      ),
    ],
  },
]
